# Chapter 7

# Handling Missing Data

In [66]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1, 2, None], dtype='float64')

float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## Filtering out Missing Data

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = np.nan

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

df.iloc[:4, 1] = np.nan

df.iloc[:2, 2] = np.nan

df

          0         1         2
0  0.198133       NaN       NaN
1  0.766126       NaN       NaN
2 -0.111526       NaN  0.019613
3  1.306591       NaN -0.429162
4  0.523062 -0.103329  1.336591
5  1.508833 -0.116618  0.966030
6 -0.439898  0.071304  0.176318

In [16]:
df.dropna()

          0         1         2
4  0.523062 -0.103329  1.336591
5  1.508833 -0.116618  0.966030
6 -0.439898  0.071304  0.176318

In [17]:
df.dropna(thresh=2)

          0         1         2
2 -0.111526       NaN  0.019613
3  1.306591       NaN -0.429162
4  0.523062 -0.103329  1.336591
5  1.508833 -0.116618  0.966030
6 -0.439898  0.071304  0.176318

## Filling In Missing Data

In [18]:
df.fillna(0)

          0         1         2
0  0.198133  0.000000  0.000000
1  0.766126  0.000000  0.000000
2 -0.111526  0.000000  0.019613
3  1.306591  0.000000 -0.429162
4  0.523062 -0.103329  1.336591
5  1.508833 -0.116618  0.966030
6 -0.439898  0.071304  0.176318

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.198133  0.500000  0.000000
1  0.766126  0.500000  0.000000
2 -0.111526  0.500000  0.019613
3  1.306591  0.500000 -0.429162
4  0.523062 -0.103329  1.336591
5  1.508833 -0.116618  0.966030
6 -0.439898  0.071304  0.176318

In [20]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

df.iloc[2:, 1] = np.nan

df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.967749 -0.204670  0.921308
1 -0.360141 -2.376021  0.629993
2 -0.169987       NaN  1.811738
3  0.767100       NaN -0.791795
4  2.266211       NaN       NaN
5  3.094132       NaN       NaN

In [21]:
df.fillna(method="ffill")

          0         1         2
0 -0.967749 -0.204670  0.921308
1 -0.360141 -2.376021  0.629993
2 -0.169987 -2.376021  1.811738
3  0.767100 -2.376021 -0.791795
4  2.266211 -2.376021 -0.791795
5  3.094132 -2.376021 -0.791795

In [22]:
df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.967749 -0.204670  0.921308
1 -0.360141 -2.376021  0.629993
2 -0.169987 -2.376021  1.811738
3  0.767100 -2.376021 -0.791795
4  2.266211       NaN -0.791795
5  3.094132       NaN -0.791795

In [23]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [24]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data["v1"] = range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [28]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [29]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [32]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"], "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [34]:
data["animal"] = data["food"].map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [36]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [38]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [39]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [40]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [42]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=["Ohio", "Colorado", "New York"],
   ....:                     columns=["one", "two", "three", "four"])

In [44]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [45]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [46]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [47]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [49]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [50]:
bins = [18, 25, 35, 60, 100]

age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [53]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [54]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [55]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [56]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [57]:
data = np.random.standard_normal(1000)

quartiles = pd.qcut(data, 4, precision=2)

quartiles

[(0.019, 0.73], (0.73, 2.78], (-0.67, 0.019], (0.019, 0.73], (-3.17, -0.67], ..., (0.73, 2.78], (-0.67, 0.019], (0.019, 0.73], (-3.17, -0.67], (0.019, 0.73]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.17, -0.67] < (-0.67, 0.019] < (0.019, 0.73] < (0.73, 2.78]]

In [58]:
pd.value_counts(quartiles)

(-3.17, -0.67]    250
(-0.67, 0.019]    250
(0.019, 0.73]     250
(0.73, 2.78]      250
Name: count, dtype: int64

In [59]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.1599999999999997, -1.245]    100
(-1.245, 0.0188]                 400
(0.0188, 1.232]                  400
(1.232, 2.781]                   100
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [60]:
pd.DataFrame(np.random.standard_normal((1000, 4)))

data.describe()

AttributeError: 'numpy.ndarray' object has no attribute 'describe'

In [ ]:
# should return:
                 0            1            2            3
# count  1000.000000  1000.000000  1000.000000  1000.000000
# mean      0.049091     0.026112    -0.002544    -0.051827
# std       0.996947     1.007458     0.995232     0.998311
# min      -3.645860    -3.184377    -3.745356    -3.428254
# 25%      -0.599807    -0.612162    -0.687373    -0.747478
# 50%       0.047101    -0.013609    -0.022158    -0.088274
# 75%       0.756646     0.695298     0.699046     0.623331
# max       2.653656     3.525865     2.735527     3.366626

In [62]:
col = data[2]

col[col.abs() > 3]

AttributeError: 'numpy.float64' object has no attribute 'abs'

In [ ]:
# should return:
# 41    -3.399312
# 136   -3.745356
# Name: 2, dtype: float64

In [63]:
data[(data.abs() > 3).any(axis="columns")]

AttributeError: 'numpy.ndarray' object has no attribute 'abs'

In [ ]:
# should return
#             0         1         2         3
# 41   0.457246 -0.025907 -3.399312 -0.974657
# 60   1.951312  3.260383  0.963301  1.201206
# 136  0.508391 -0.196713 -3.745356 -1.520113
# 235 -0.242459 -3.056990  1.918403 -0.578828
# 258  0.682841  0.326045  0.425384 -3.428254
# 322  1.179227 -3.184377  1.369891 -1.074833
# 544 -3.548824  1.553205 -2.186301  1.277104
# 635 -0.578093  0.193299  1.397822  3.366626
# 782 -0.207434  3.525865  0.283070  0.544635
# 803 -3.645860  0.255475 -0.549574 -1.907459

In [64]:
data[data.abs() > 3] = np.sign(data) * 3

data.describe()

AttributeError: 'numpy.ndarray' object has no attribute 'abs'

In [ ]:
# should return
                 0            1            2            3
# count  1000.000000  1000.000000  1000.000000  1000.000000
# mean      0.050286     0.025567    -0.001399    -0.051765
# std       0.992920     1.004214     0.991414     0.995761
# min      -3.000000    -3.000000    -3.000000    -3.000000
# 25%      -0.599807    -0.612162    -0.687373    -0.747478
# 50%       0.047101    -0.013609    -0.022158    -0.088274
# 75%       0.756646     0.695298     0.699046     0.623331
# max       2.653656     3.000000     2.735527     3.000000

In [65]:
np.sign(data).head()

AttributeError: 'numpy.ndarray' object has no attribute 'head'

In [ ]:
# should return:
#      0    1    2    3
# 0 -1.0  1.0 -1.0  1.0
# 1  1.0 -1.0  1.0 -1.0
# 2  1.0  1.0  1.0 -1.0
# 3 -1.0 -1.0  1.0 -1.0
# 4 -1.0  1.0 -1.0 -1.0

## Permutation and Random Sampling

In [67]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [68]:
sampler = np.random.permutation(5)

sampler

array([3, 4, 1, 2, 0])

In [70]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [69]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [71]:
column_sampler = np.random.permutation(7)

column_sampler

array([3, 4, 2, 1, 6, 5, 0])

In [72]:
df.take(column_sampler, axis="columns")

    3   4   2   1   6   5   0
0   3   4   2   1   6   5   0
1  10  11   9   8  13  12   7
2  17  18  16  15  20  19  14
3  24  25  23  22  27  26  21
4  31  32  30  29  34  33  28

In [73]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [74]:
choices = pd.Series([5, 7, -1, 6, 4])

choices.sample(n=10, replace=True)

1    7
3    6
1    7
4    4
1    7
1    7
4    4
1    7
1    7
4    4
dtype: int64

## Computing Indicator/Dummy Variables

In [75]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": range(6)})

df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [76]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [77]:
dummies = pd.get_dummies(df["key"], prefix="key")

df_with_dummy = df[["data1"]].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [78]:
mnames = ["movie_id", "title", "genres"]

movies = pd.read_table("datasets/movielens/movies.dat", sep="::", header=None, names=mnames, engine="python")

movies[:10]

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [ ]:
# should return
#  movie_id                               title                        genres
# 0         1                    Toy Story (1995)   Animation|Children's|Comedy
# 1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
# 2         3             Grumpier Old Men (1995)                Comedy|Romance
# 3         4            Waiting to Exhale (1995)                  Comedy|Drama
# 4         5  Father of the Bride Part II (1995)                        Comedy
# 5         6                         Heat (1995)         Action|Crime|Thriller
# 6         7                      Sabrina (1995)                Comedy|Romance
# 7         8                 Tom and Huck (1995)          Adventure|Children's
# 8         9                 Sudden Death (1995)                        Action
# 9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [79]:
dummies = movies["genres"].str.get_dummies("|")

dummies.iloc[:10, :6]

NameError: name 'movies' is not defined

In [ ]:
# should return
#    Action  Adventure  Animation  Children's  Comedy  Crime
# 0       0          0          1           1       1      0
# 1       0          1          0           1       0      0
# 2       0          0          0           0       1      0
# 3       0          0          0           0       1      0
# 4       0          0          0           0       1      0
# 5       1          0          0           0       0      1
# 6       0          0          0           0       1      0
# 7       0          1          0           1       0      0
# 8       1          0          0           0       0      0
# 9       1          1          0           0       0      0

In [80]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

movies_windic.iloc[0]

NameError: name 'movies' is not defined

In [ ]:
# should return
# movie_id                                       1
# title                           Toy Story (1995)
# genres               Animation|Children's|Comedy
# Genre_Action                                   0
# Genre_Adventure                                0
# Genre_Animation                                1
# Genre_Children's                               1
# Genre_Comedy                                   1
# Genre_Crime                                    0
# Genre_Documentary                              0
# Genre_Drama                                    0
# Genre_Fantasy                                  0
# Genre_Film-Noir                                0
# Genre_Horror                                   0
# Genre_Musical                                  0
# Genre_Mystery                                  0
# Genre_Romance                                  0
# Genre_Sci-Fi                                   0
# Genre_Thriller                                 0
# Genre_War                                      0
# Genre_Western                                  0
# Name: 0, dtype: object

In [81]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)

values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [82]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

# Extension Data Types

In [83]:
s = pd.Series([1, 2, 3, None])

s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [84]:
s.dtype

dtype('float64')

In [85]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [86]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [87]:
s.dtype

Int64Dtype()

In [88]:
s[3]

In [89]:
s[3] is pd.NA

True

In [90]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [91]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

s

0      one
1      two
2     <NA>
3    three
dtype: string

In [93]:
df = pd.DataFrame({"A": [1, 2, None, 4], "B": ["one", "two", "three", None], "C": [False, None, False, True]})

df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [94]:
df["A"] = df["A"].astype("Int64")

df["B"] = df["B"].astype("string")

df["C"] = df["C"].astype("boolean")

df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

# String Manipulation

## Python Built-In String Object Methods

In [95]:
val = "a,b,  guido"

val.split(",")

['a', 'b', '  guido']

In [96]:
pieces = [x.strip() for x in val.split(",")]

pieces

['a', 'b', 'guido']

In [97]:
first, second, third = pieces

first + "::" + second + "::" + third

'a::b::guido'

In [98]:
"::".join(pieces)

'a::b::guido'

In [99]:
"guido" in val

True

In [100]:
val.index(",")

1

In [101]:
val.find(":")

-1

In [102]:
val.index(":")
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-161-bea4c4c30248> in <module>
----> 1 val.index(":")
ValueError: substring not found

SyntaxError: invalid syntax (3234626725.py, line 2)

In [103]:
val.count(",")

2

In [104]:
val.replace(",", "::")

'a::b::  guido'

In [105]:
val.replace(",", "")

'ab  guido'

## Regular Expressions

In [107]:
import re

text = "foo    bar\t baz  \tqux"

In [108]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [109]:
regex = re.compile(r"\s+")

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [111]:
regex.findall(text)

['    ', '\t ', '  \t']

In [112]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [113]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [115]:
m = regex.search(text)

m

In [116]:
text[m.start():m.end()]

'dave@google.com'

In [118]:
print(regex.match(text))

None

In [120]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [ ]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

regex = re.compile(pattern, flags=re.IGNORECASE)

In [122]:
m = regex.match("wesm@bright.net")

m.groups()

()

In [ ]:
# should return
# ('wesm', 'bright', 'net')

In [126]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [ ]:
# should return
# [('dave', 'google', 'com'),
#  ('steve', 'gmail', 'com'),
#  ('rob', 'gmail', 'com'),
#  ('ryan', 'yahoo', 'com')]

In [124]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

error: invalid group reference 1 at position 11

In [ ]:
# should return
# Dave Username: dave, Domain: google, Suffix: com
# Steve Username: steve, Domain: gmail, Suffix: com
# Rob Username: rob, Domain: gmail, Suffix: com
# Ryan Username: ryan, Domain: yahoo, Suffix: com

## String Functions in pandas

In [127]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com", "Rob": "rob@gmail.com", "Wes": np.nan}

data = pd.Series(data)

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [128]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [129]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [130]:
data_as_string_ext = data.astype('string')

data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [131]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [132]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [133]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [134]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [135]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [136]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

# Categorical Data

## Background and Motivation

In [137]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)

values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [138]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [139]:
pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [140]:
values = pd.Series([0, 1, 0, 0] * 2)

dim = pd.Series(['apple', 'orange'])

values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [141]:
dim

0     apple
1    orange
dtype: object

In [142]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

## Categorical Extension Type in pandas

In [143]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2

N = len(fruits)

rng = np.random.default_rng(seed=12345)

df = pd.DataFrame({'fruit': fruits, 'basket_id': np.arange(N), 'count': rng.integers(3, 15, size=N), 'weight': rng.uniform(0, 4, size=N)}, columns=['basket_id', 'fruit', 'count', 'weight'])

df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [144]:
fruit_cat = df['fruit'].astype('category')

fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [145]:
c = fruit_cat.array

type(c)

pandas.core.arrays.categorical.Categorical

In [146]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [147]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [148]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [149]:
df['fruit'] = df['fruit'].astype('category')

df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [150]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [151]:
categories = ['foo', 'bar', 'baz']

codes = [0, 1, 2, 0, 0, 1]

my_cats_2 = pd.Categorical.from_codes(codes, categories)

my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [152]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)

ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [153]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

## Computations with Categoricals

In [154]:
rng = np.random.default_rng(seed=12345)

draws = rng.standard_normal(1000)

draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [155]:
bins = pd.qcut(draws, 4)

bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [156]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [157]:
bins = pd.Series(bins, name='quartile')

results = (pd.Series(draws).groupby(bins).agg(['count', 'min', 'max']).reset_index())

results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [158]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [161]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [162]:
categories = labels.astype('category')

In [163]:
labels.memory_usage(deep=True)

600000132

In [164]:
categories.memory_usage(deep=True)

10000544

In [165]:
%time _ = labels.astype('category')

CPU times: user 242 ms, sys: 26.2 ms, total: 268 ms
Wall time: 265 ms

In [166]:
%timeit labels.value_counts()

191 ms  5.71 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [167]:
%timeit categories.value_counts()

31.2 ms  599 s per loop (mean  std. dev. of 7 runs, 10 loops each)

## Categorical Methods

In [168]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

cat_s = s.astype('category')

cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [169]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [170]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [171]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

cat_s2 = cat_s.cat.set_categories(actual_categories)

cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [172]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [173]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [174]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [175]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [ ]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [176]:
pd.get_dummies(cat_s)

       a      b      c      d
0   True  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False   True
4   True  False  False  False
5  False   True  False  False
6  False  False   True  False
7  False  False  False   True